rest-api/jmeter-api.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="3.1" jmeter="3.1 r1770033">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">10</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">200</stringProp>
        <stringProp name="ThreadGroup.ramp_time">15</stringProp>
        <longProp name="ThreadGroup.start_time">1525071694000</longProp>
        <longProp name="ThreadGroup.end_time">1525071694000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;carrier_delays&quot;:[{&quot;UNIQUE_CARRIER&quot;:&quot;WN&quot;,&quot;count(*)&quot;:18660},{&quot;UNIQUE_CARRIER&quot;:&quot;OO&quot;,&quot;count(*)&quot;:16850},{&quot;UNIQUE_CARRIER&quot;:&quot;AA&quot;,&quot;count(*)&quot;:13136},{&quot;UNIQUE_CARRIER&quot;:&quot;DL&quot;,&quot;count(*)&quot;:10882},{&quot;UNIQUE_CARRIER&quot;:&quot;B6&quot;,&quot;count(*)&quot;:8059},{&quot;UNIQUE_CARRIER&quot;:&quot;UA&quot;,&quot;count(*)&quot;:7197},{&quot;UNIQUE_CARRIER&quot;:&quot;OH&quot;,&quot;count(*)&quot;:6158},{&quot;UNIQUE_CARRIER&quot;:&quot;MQ&quot;,&quot;count(*)&quot;:5871},{&quot;UNIQUE_CARRIER&quot;:&quot;EV&quot;,&quot;count(*)&quot;:5476},{&quot;UNIQUE_CARRIER&quot;:&quot;YX&quot;,&quot;count(*)&quot;:5357},{&quot;UNIQUE_CARRIER&quot;:&quot;9E&quot;,&quot;count(*)&quot;:4347},{&quot;UNIQUE_CARRIER&quot;:&quot;YV&quot;,&quot;count(*)&quot;:3696},{&quot;UNIQUE_CARRIER&quot;:&quot;F9&quot;,&quot;count(*)&quot;:2768},{&quot;UNIQUE_CARRIER&quot;:&quot;NK&quot;,&quot;count(*)&quot;:2561},{&quot;UNIQUE_CARRIER&quot;:&quot;G4&quot;,&quot;count(*)&quot;:1693},{&quot;UNIQUE_CARRIER&quot;:&quot;AS&quot;,&quot;count(*)&quot;:1588},{&quot;UNIQUE_CARRIER&quot;:&quot;VX&quot;,&quot;count(*)&quot;:881},{&quot;UNIQUE_CARRIER&quot;:&quot;HA&quot;,&quot;count(*)&quot;:785}]}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">arthur-load-balancer-1986817145.us-west-2.elb.amazonaws.com</stringProp>
          <stringProp name="HTTPSampler.port">80</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
          <boolProp name="HTTPSampler.monitor">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>